0.1.0/tutorials/incompressible/pimple/tjunction/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     mousse-pimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1.5;
deltaT          0.001;
writeControl    adjustableRunTime;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           5;
functions
{
  probes
  {
    // Where to load it from
    functionObjectLibs ( "libsampling.so" );
    type            probes;
    // Name of the directory for probe data
    name            probes;
    // Write at same frequency as fields
    outputControl   outputTime;
    outputInterval  1;
    // Fields to be probed
    fields
    (
      p U
    );
    probeLocations
    (
      ( 1e-06 0 0.01 )        // at inlet
      (0.21 -0.20999 0.01)  // at outlet1
      (0.21 0.20999 0.01)   // at outlet2
      (0.21 0 0.01)         // at central block
    );
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
