0.1.0/tutorials/incompressible/pimple/tjunction/0/nut
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet1
  {
    type            calculated;
    value           uniform 0;
  }
  outlet2
  {
    type            calculated;
    value           uniform 0;
  }
  defaultFaces
  {
    type            nutkWallFunction;
    value           uniform 0;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
