0.1.0/tutorials/incompressible/pimple/tjunction/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      Gauss limitedLinearV 1;
  div(phi,k)      Gauss limitedLinear 1;
  div(phi,epsilon) Gauss limitedLinear 1;
  div(phi,R)      Gauss limitedLinear 1;
  div(R)          Gauss linear;
  div(phi,nuTilda) Gauss limitedLinear 1;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
