0.1.0/tutorials/incompressible/pimple/tjunction/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0.01;
    smoother        GaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  pFinal
  {
    solver          GAMG;
    tolerance       1e-06;
    relTol          0;
    smoother        GaussSeidel;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  "(U|k|epsilon)"
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0.1;
  }
  "(U|k|epsilon)Final"
  {
    $U;
    tolerance       1e-05;
    relTol          0;
  }
}
PIMPLE
{
  nOuterCorrectors 1;
  nCorrectors     2;
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;
}
relaxationFactors
{
  equations
  {
    "U.*"           1;
    "k.*"           1;
    "epsilon.*"     1;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
